# Day16 - Pandas를 통한 데이터 전처리 3

### 행 삭제
- DataFrame객체.drop(index/list/배열, [axis=0])
    - 새로운 DataFrame 객체 반환

In [65]:
import pandas as pd
import numpy as np

In [2]:
scores = [[84,87,78],[21,15,84],[87,84,76],[100,87,99],[59,99,59],[46,77,56]]

In [3]:
names = ['철수','영이','길동','미영','순이','철이']

In [4]:
lectures = ['국어','영어','수학']

In [5]:
d1 = pd.DataFrame(scores, index = names, columns = lectures)

In [6]:
d1

     국어  영어  수학
철수   84  87  78
영이   21  15  84
길동   87  84  76
미영  100  87  99
순이   59  99  59
철이   46  77  56

In [7]:
d1.drop('철수', axis=0)

     국어  영어  수학
영이   21  15  84
길동   87  84  76
미영  100  87  99
순이   59  99  59
철이   46  77  56

In [8]:
d1

     국어  영어  수학
철수   84  87  78
영이   21  15  84
길동   87  84  76
미영  100  87  99
순이   59  99  59
철이   46  77  56

In [9]:
d1.drop(['영이','미영'], axis=0)

    국어  영어  수학
철수  84  87  78
길동  87  84  76
순이  59  99  59
철이  46  77  56

In [10]:
d1

     국어  영어  수학
철수   84  87  78
영이   21  15  84
길동   87  84  76
미영  100  87  99
순이   59  99  59
철이   46  77  56

### 행 삭제
- DataFrame객체.drop(index/list/배열, [axis=0], inplace=True)
    - 원본 객체 변경

In [12]:
d1.drop('영이', axis=0, inplace=True)

In [13]:
d1

     국어  영어  수학
철수   84  87  78
길동   87  84  76
미영  100  87  99
순이   59  99  59
철이   46  77  56

### 열 삭제
- DataFrame객체.drop(column명/list/배열, axis=1)
    - 새로운 DataFrame 객체 반환

In [14]:
d1.drop('국어', axis = 1)

    영어  수학
철수  87  78
길동  84  76
미영  87  99
순이  99  59
철이  77  56

In [15]:
d1

     국어  영어  수학
철수   84  87  78
길동   87  84  76
미영  100  87  99
순이   59  99  59
철이   46  77  56

In [16]:
d1.drop(['영어','수학'], axis = 1)

     국어
철수   84
길동   87
미영  100
순이   59
철이   46

In [17]:
d1

     국어  영어  수학
철수   84  87  78
길동   87  84  76
미영  100  87  99
순이   59  99  59
철이   46  77  56

열 삭제
- DataFrame객체.drop(column명/list/배열, axis=1, inplace=True)

행 추가
- DataFrame객체.loc[새index명] = 데이터

In [19]:
scores = [[84,87,78],[21,15,84],[87,84,76],[100,87,99],[59,99,59],[46,77,56]]

In [20]:
names = ['철수','영이','길동','미영','순이','철이']

In [21]:
lectures = ['국어','영어','수학']

In [22]:
d1 = pd.DataFrame(scores, index = names, columns = lectures)

In [23]:
d1

     국어  영어  수학
철수   84  87  78
영이   21  15  84
길동   87  84  76
미영  100  87  99
순이   59  99  59
철이   46  77  56

In [25]:
d1.loc['합계'] = d1.sum(axis=0)

In [26]:
d1

     국어   영어   수학
철수   84   87   78
영이   21   15   84
길동   87   84   76
미영  100   87   99
순이   59   99   59
철이   46   77   56
합계  397  449  452

### 열 추가
- DataFrame객체[새column명] = 데이터

In [27]:
d1

     국어   영어   수학
철수   84   87   78
영이   21   15   84
길동   87   84   76
미영  100   87   99
순이   59   99   59
철이   46   77   56
합계  397  449  452

In [28]:
d1['합계'] = d1.sum(axis=1)

In [29]:
d1

     국어   영어   수학    합계
철수   84   87   78   249
영이   21   15   84   120
길동   87   84   76   247
미영  100   87   99   286
순이   59   99   59   217
철이   46   77   56   179
합계  397  449  452  1298

### 행의 값 수정
- DataFrame객체.loc[index명] = 데이터

In [30]:
d1

     국어   영어   수학    합계
철수   84   87   78   249
영이   21   15   84   120
길동   87   84   76   247
미영  100   87   99   286
순이   59   99   59   217
철이   46   77   56   179
합계  397  449  452  1298

In [32]:
d1.drop('합계', axis=0, inplace=True)

In [33]:
d1

     국어  영어  수학   합계
철수   84  87  78  249
영이   21  15  84  120
길동   87  84  76  247
미영  100  87  99  286
순이   59  99  59  217
철이   46  77  56  179

In [34]:
d1.drop('합계', axis=1, inplace=True)
d1

     국어  영어  수학
철수   84  87  78
영이   21  15  84
길동   87  84  76
미영  100  87  99
순이   59  99  59
철이   46  77  56

In [35]:
d1.loc['철수'] = [80, 90, 80]

In [36]:
d1

     국어  영어  수학
철수   80  90  80
영이   21  15  84
길동   87  84  76
미영  100  87  99
순이   59  99  59
철이   46  77  56

### 행의 값 수정
- DataFrame객체.iloc[index번호] = 데이터

In [37]:
d1

     국어  영어  수학
철수   80  90  80
영이   21  15  84
길동   87  84  76
미영  100  87  99
순이   59  99  59
철이   46  77  56

In [38]:
d1.iloc[0] = [84, 87, 78]

In [39]:
d1

     국어  영어  수학
철수   84  87  78
영이   21  15  84
길동   87  84  76
미영  100  87  99
순이   59  99  59
철이   46  77  56

### 열의 값 수정
- DataFrame객체[column명] = 데이터

In [40]:
d1

     국어  영어  수학
철수   84  87  78
영이   21  15  84
길동   87  84  76
미영  100  87  99
순이   59  99  59
철이   46  77  56

In [41]:
d1['국어'] = [80,30,90,100,60,50]

In [42]:
d1

     국어  영어  수학
철수   80  87  78
영이   30  15  84
길동   90  84  76
미영  100  87  99
순이   60  99  59
철이   50  77  56

#### 실습1) DataFrame을 이용하여 다음과 같이 실행되는 프로그램을 작성하시오

In [79]:
names = input('학생들의 이름 입력(,로 구분) :').split(',')
score_kor = input('학생들의 국어 성적 입력(,로 구분) :').split(',')
score_eng = input('학생들의 영어 성적 입력(,로 구분) :').split(',')
score_math = input('학생들의 수학 성적 입력(,로 구분) :').split(',')

score_kor = [int (i) for i in score_kor]
score_eng = [int (i) for i in score_eng]
score_math = [int (i) for i in score_math]

학생들의 이름 입력(,로 구분) : 철수,영희,미영
학생들의 국어 성적 입력(,로 구분) : 90,80,80
학생들의 영어 성적 입력(,로 구분) : 80,80,90
학생들의 수학 성적 입력(,로 구분) : 70,89,88

In [80]:
s_kor = pd.Series(score_kor, index = names)
s_eng = pd.Series(score_eng, index = names)
s_math = pd.Series(score_math, index = names)

In [81]:
d = pd.DataFrame()
d['국어'] = s_kor
d['영어'] = s_eng
d['수학'] = s_math
d['합계'] = d.국어 + d.영어 + d.수학
#d['합계'] = s_kor + s_eng + s_math

In [82]:
print(d)

    국어  영어  수학   합계
철수  90  80  70  240
영희  80  80  89  249
미영  80  90  88  258

In [83]:
s_kor

철수    90
영희    80
미영    80
dtype: int64

In [84]:
s_eng

철수    80
영희    80
미영    90
dtype: int64

In [85]:
s_math

철수    70
영희    89
미영    88
dtype: int64

### Index, columns, values 접근
- Index: DataFrame객체.index
- Columns: DataFrame객체.columns
- Values: DataFrame객체.values

In [87]:
scores = [[84,87,78],[21,15,84],[87,84,76],[100,87,99],[59,99,59],[46,77,56]]

In [88]:
names = ['철수','영이','길동','미영','순이','철이']

In [89]:
lectures = ['국어','영어','수학']

In [90]:
d1 = pd.DataFrame(scores, index = names, columns = lectures)

In [91]:
d1

     국어  영어  수학
철수   84  87  78
영이   21  15  84
길동   87  84  76
미영  100  87  99
순이   59  99  59
철이   46  77  56

In [92]:
d1.index

Index(['철수', '영이', '길동', '미영', '순이', '철이'], dtype='object')

In [93]:
d1.columns

Index(['국어', '영어', '수학'], dtype='object')

In [94]:
d1.values

array([[ 84,  87,  78],
       [ 21,  15,  84],
       [ 87,  84,  76],
       [100,  87,  99],
       [ 59,  99,  59],
       [ 46,  77,  56]])

### []을 이용한 선택
- 열 indexing: DataFrame객체[column명] 또는 DataFrame객체.column명

In [95]:
d1['국어']

철수     84
영이     21
길동     87
미영    100
순이     59
철이     46
Name: 국어, dtype: int64

In [96]:
d1.수학

철수    78
영이    84
길동    76
미영    99
순이    59
철이    56
Name: 수학, dtype: int64

### []을 이용한 선택
- 행 slicing: DataFrame객체[행번호:행번호] 또는 DataFrame객체[index명:index명]

In [97]:
d1[1:3]

    국어  영어  수학
영이  21  15  84
길동  87  84  76

In [98]:
d1['길동':'순이']

     국어  영어  수학
길동   87  84  76
미영  100  87  99
순이   59  99  59

### []을 이용한 선택
- 열과 행 같이 선택
    - DataFrame객체[column명][행번호:행번호]
    - DataFrame객체[column명][index명: index명]
    - DataFrame객체.column명[행번호:행번호]
    - DataFrame객체.column명[index명 : index명]

In [99]:
d1

     국어  영어  수학
철수   84  87  78
영이   21  15  84
길동   87  84  76
미영  100  87  99
순이   59  99  59
철이   46  77  56

In [100]:
d1['국어'][1:3]

영이    21
길동    87
Name: 국어, dtype: int64

In [101]:
d1['영어'][1:3]

영이    15
길동    84
Name: 영어, dtype: int64

In [102]:
d1['수학']['철수':'길동']

철수    78
영이    84
길동    76
Name: 수학, dtype: int64

In [103]:
d1.수학['철수':'길동']

철수    78
영이    84
길동    76
Name: 수학, dtype: int64

### loc를 이용한 행 선택
- index명 사용
- 열 추가 시 comma 사용
- 열 추가 시

In [104]:
d1

     국어  영어  수학
철수   84  87  78
영이   21  15  84
길동   87  84  76
미영  100  87  99
순이   59  99  59
철이   46  77  56

In [105]:
d1.loc['철수','국어':'수학']

국어    84
영어    87
수학    78
Name: 철수, dtype: int64

In [107]:
d1.loc['영이']

국어    21
영어    15
수학    84
Name: 영이, dtype: int64

In [108]:
d1.loc['영이':'순이','영어']

영이    15
길동    84
미영    87
순이    99
Name: 영어, dtype: int64

### iloc를 이용한 행 선택
- 번호 사용
- 열 추가 시 comma 사용

In [113]:
d1

     국어  영어  수학
철수   84  87  78
영이   21  15  84
길동   87  84  76
미영  100  87  99
순이   59  99  59
철이   46  77  56

In [110]:
d1.iloc[0]

국어    84
영어    87
수학    78
Name: 철수, dtype: int64

In [111]:
d1.iloc[0,1]

87

In [112]:
d1.iloc[0, 1:3]

영어    87
수학    78
Name: 철수, dtype: int64

In [114]:
d1.iloc[1:3]

    국어  영어  수학
영이  21  15  84
길동  87  84  76

In [115]:
d1.iloc[[1,2]]

    국어  영어  수학
영이  21  15  84
길동  87  84  76

In [116]:
d1.iloc[1,[0,1]]

국어    21
영어    15
Name: 영이, dtype: int64

### 산술 연산
- Array, series와 비슷

In [117]:
d1

     국어  영어  수학
철수   84  87  78
영이   21  15  84
길동   87  84  76
미영  100  87  99
순이   59  99  59
철이   46  77  56

In [118]:
d1.iloc[0] + d1.iloc[1]

국어    105
영어    102
수학    162
dtype: int64

In [119]:
d1.수학 + d1.영어

철수    165
영이     99
길동    160
미영    186
순이    158
철이    133
dtype: int64

In [120]:
d1.sum()

국어    397
영어    449
수학    452
dtype: int64

In [121]:
d1.sum(axis=1)

철수    249
영이    120
길동    247
미영    286
순이    217
철이    179
dtype: int64

### 논리 연산과 filtering
- Array, series와 비슷

In [122]:
d1

     국어  영어  수학
철수   84  87  78
영이   21  15  84
길동   87  84  76
미영  100  87  99
순이   59  99  59
철이   46  77  56

In [125]:
x = d1.수학 > 60
x

철수     True
영이     True
길동     True
미영     True
순이    False
철이    False
Name: 수학, dtype: bool

In [126]:
d1[x]

     국어  영어  수학
철수   84  87  78
영이   21  15  84
길동   87  84  76
미영  100  87  99

In [127]:
x = d1 > 80
x

       국어     영어     수학
철수   True   True  False
영이  False  False   True
길동   True   True  False
미영   True   True   True
순이  False   True  False
철이  False  False  False

In [128]:
d1[x]

       국어    영어    수학
철수   84.0  87.0   NaN
영이    NaN   NaN  84.0
길동   87.0  84.0   NaN
미영  100.0  87.0  99.0
순이    NaN  99.0   NaN
철이    NaN   NaN   NaN

### 열 기준 정렬하기
- index 기준: DataFrame객체.sort_index(ascending = True/False)
- 특정 열 기준: DataFrame객체.sort_values(by = 'column명', ascending = True/False)

In [129]:
d1

     국어  영어  수학
철수   84  87  78
영이   21  15  84
길동   87  84  76
미영  100  87  99
순이   59  99  59
철이   46  77  56

In [130]:
d1.sort_index()

     국어  영어  수학
길동   87  84  76
미영  100  87  99
순이   59  99  59
영이   21  15  84
철수   84  87  78
철이   46  77  56

In [132]:
d1.sort_values(by = '국어', ascending = False)

     국어  영어  수학
미영  100  87  99
길동   87  84  76
철수   84  87  78
순이   59  99  59
철이   46  77  56
영이   21  15  84

#### 실습2) DataFrame을 이용하여 다음과 같이 실행되는 프로그램을 작성하시오.

In [134]:
names = input('학생들의 이름 입력(,로 구분) :').split(',')
score_kor = input('학생들의 국어 성적 입력(,로 구분) :').split(',')
score_eng = input('학생들의 영어 성적 입력(,로 구분) :').split(',')
score_math = input('학생들의 수학 성적 입력(,로 구분) :').split(',')

score_kor = [int (i) for i in score_kor]
score_eng = [int (i) for i in score_eng]
score_math = [int (i) for i in score_math]

학생들의 이름 입력(,로 구분) : 영희,철수,미미
학생들의 국어 성적 입력(,로 구분) : 30,50,80
학생들의 영어 성적 입력(,로 구분) : 40,50,70
학생들의 수학 성적 입력(,로 구분) : 30,60,90

In [159]:
s_kor = pd.Series(score_kor, index = names)
s_eng = pd.Series(score_eng, index = names)
s_math = pd.Series(score_math, index = names)

In [160]:
d = pd.DataFrame()
d['국어'] = s_kor
d['영어'] = s_eng
d['수학'] = s_math
d['합계'] = d.국어 + d.영어 + d.수학
#d['합계'] = s_kor + s_eng + s_math

In [161]:
d

    국어  영어  수학   합계
영희  30  40  30  100
철수  50  50  60  160
미미  80  70  90  240

In [162]:
d['합계'] = d.sum(axis=1)
d.loc['평균'] = d.sum() // len(names)

In [163]:
d

    국어  영어  수학   합계
영희  30  40  30  200
철수  50  50  60  320
미미  80  70  90  480
평균  53  53  60  333

In [164]:
name = input('검색할 학생 이름은?')
d.loc[name]

검색할 학생 이름은? 철수

국어     50
영어     50
수학     60
합계    320
Name: 철수, dtype: int64

#### 실습3) DataFrame을 이용하여 다음과 같이 실행되는 프로그램을 작성하시오.

In [165]:
names = input('학생들의 이름 입력(,로 구분) :').split(',')
score_kor = input('학생들의 국어 성적 입력(,로 구분) :').split(',')
score_eng = input('학생들의 영어 성적 입력(,로 구분) :').split(',')
score_math = input('학생들의 수학 성적 입력(,로 구분) :').split(',')

score_kor = [int (i) for i in score_kor]
score_eng = [int (i) for i in score_eng]
score_math = [int (i) for i in score_math]

학생들의 이름 입력(,로 구분) : 철수,영미,길동
학생들의 국어 성적 입력(,로 구분) : 50,70,90
학생들의 영어 성적 입력(,로 구분) : 80,75,80
학생들의 수학 성적 입력(,로 구분) : 95,85,90

In [166]:
s_kor = pd.Series(score_kor, index = names)
s_eng = pd.Series(score_eng, index = names)
s_math = pd.Series(score_math, index = names)

In [167]:
d = pd.DataFrame()
d['국어'] = s_kor
d['영어'] = s_eng
d['수학'] = s_math

In [168]:
d['합계'] = d.sum(axis=1)

In [169]:
d

    국어  영어  수학   합계
철수  50  80  95  225
영미  70  75  85  230
길동  90  80  90  260

In [178]:
sort = input('정렬기준 선택(1:국어, 2:영어, 3:수학, 4:합계):')
sort_method = input('정렬방법 선택(1:오름차순, 2:내림차순):')

정렬기준 선택(1:국어, 2:영어, 3:수학, 4:합계): 4
정렬방법 선택(1:오름차순, 2:내림차순): 2

In [183]:
if sort_method == '1':
    s_method = True
else:
    s_method = False

In [185]:
if sort == '1':
    d_new = d.sort_values(by = '국어', ascending = s_method)
elif sort == '2':
    d_new = d.sort_values(by = '영어', ascending = s_method)
elif sort == '3':
    d_new = d.sort_values(by = '수학', ascending = s_method)
elif sort == '4':
    d_new = d.sort_values(by = '합계', ascending = s_method)

In [186]:
print(d_new)

    국어  영어  수학   합계
길동  90  80  90  260
영미  70  75  85  230
철수  50  80  95  225